#+title:      B Klasse 2022-26
#+date:       [2022-12-30 Fr 19:34]
#+filetags:   :1b:Project:
#+identifier: 20221230T193456
#+CATEGORY: golling
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib


* 1b 10:40-11:30
<%%(org-class 2022 9 13 2023 7 4 2)>

Buch ...

[[denote:20230403T101428][Auferstehung]]

* 1b 11:35-12:25
<%%(org-class 2022 9 16 2023 7 7 5)>

Buch Kapitel 6:
Vielfalt der Religionen

Drei christliche Konfessionen

[[denote:20230403T101428][Auferstehung]]

* Supplierstunde 1b BU (Hannes Lacher) 10:40-11:30
<%%(org-class 2023 3 8 2023 7 5 3 19)>
aktueller Stoff: Säugetiere / Fische.
Buch S. 104ff

Buch S. 106 / 107
Arbeitsheft S. 54

* Reflexionen

** [[denote:20221226T162523][Grundgebete]]
PERIOD: [2023-01-27 Fr 11:35]

Die Klasse hat sich bei mir für ihr recht schlimmes Verhalten entschuldigt, sie hat einen kleinen Brief geschrieben. Leider hat die versprochene Besserung nicht lange angehalten; aber das wird schon noch, davon bin ich überzeugt.

Thema heute: Vater unser.


* 1B [KV Martin Pock]

#+Name: 2021-students
| First     | Last       | Name               | Note | Heft | Mitarbeit | LZK |
|-----------+------------+--------------------+------+------+-----------+-----|
| Lorenz    | Aschauer   | [[LorenzAschauer][Lorenz Aschauer]]    |    2 |      |           |     |
| Stefan    | Atanasov   | [[StefanAtanasov][Stefan Atanasov]]    |    2 |      |           |     |
| Lela      | Dent       | [[LelaDent][Lela Dent]]          |    1 |      |           |     |
| Emma      | Gonschorek | [[EmmaGonschorek][Emma Gonschorek]]    |    1 |      |           |     |
| Marie     | Hofer      | [[MarieHofer][Marie Hofer]]        |    1 |      |           |     |
| Hubert    | Keinrad    | [[HubertKeinrad][Hubert Keinrad]]     |    1 |      |           |     |
| Nena      | Langenfeld | [[NenaLangenfeld][Nena Langenfeld]]    |    1 |      |           |     |
| Bernhard  | Neureiter  | [[BernhardNeureiter][Bernhard Neureiter]] |    2 |      |           |     |
| Manuel    | Reiter     | [[ManuelReiter][Manuel Reiter]]      |    1 |      |           |     |
| Emma      | Riebler    | [[EmmaRiebler][Emma Riebler]]       |    1 |      |           |     |
| Annika    | Seiwald    | [[AnnikaSeiwald][Annika Seiwald]]     |    1 |      |           |     |
| Valerian  | Seling     | [[ValerianSeling][Valerian Seling]]    |    2 |      |           |     |
| Theresa   | Steiner    | [[TheresaSteiner][Theresa Steiner]]    |    1 |      |           |     |
| Valentina | Struber    | [[ValentinaStruber][Valentina Struber]]  |    1 |      |           |     |
| Felix     | Wenger     | [[FelixWenger][Felix Wenger]]       |    1 |      |           |     |
| Leon      | Zemmer     | [[LeonZemmer][Leon Zemmer]]        |    1 |      |           |     |
| Fabian    | Zorzi      | [[FabianZorzi][Fabian Zorzi]]       |    1 |      |           |     |
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $1='(identity remote(2021-students,@@#$4))
#+TBLFM: $3='(concat "[[" $1 $2 "][" $1 " " $2 "]]")

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + last + '\n\n')
#+END_SRC

#+RESULTS:
* Mitarbeit
** LorenzAschauer
stört häufig

** StefanAtanasov
ist unruhig

** LelaDent


** EmmaGonschorek
fleißig

** MarieHofer


** HubertKeinrad


** NenaLangenfeld


** BernhardNeureiter


** ManuelReiter


** EmmaRiebler

*** [[denote:20221226T162523][Grundgebete]]
PERIOD: [2023-01-27 Fr 11:35]

Hat gut mitgearbeitet.


** AnnikaSeiwald


** ValerianSeling
unruhig;

** TheresaSteiner


** ValentinaStruber


** FelixWenger


** LeonZemmer


** FabianZorzi





